#include <bits/stdc++.h>
using namespace std ;

class Player{
    public:
    string name;

    Player(){
        name = "";
    }
};

class Game{
    public: 
    string name;

    Game(){
        name = "";
    }

    void takeName(){
        cout<<"Please Enter you Name:";
        cin>>this->name;
    }

    bool StartGame(){
        string s = R"(
    ████████╗███████╗████████╗ █████╗ ███████╗ 
    ██╔════╝╚══██╔══╝██╔══██╗██╔══██╗╚══██╔══╝
    ███████╗   ██║   ███████║██████╔╝   ██║   
    ╚════██║   ██║   ██╔══██║██╔══██╗   ██║   
    ███████║   ██║   ██║  ██║██║  ██║   ██║   
    ╚══════╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝   
                                            
    ██████╗  █████╗ ███╗   ███╗███████╗      
    ██╔════╝ ██╔══██╗████╗ ████║██╔════╝      
    ██║  ███╗███████║██╔████╔██║█████╗        
    ██║   ██║██╔══██║██║╚██╔╝██║██╔══╝        
    ╚██████╔╝██║  ██║██║ ╚═╝ ██║███████╗      
    ╚═════╝ ╚═╝  ╚═╝╚═╝     ╚═╝╚══════╝      
            )";

    cout<<"\033[31m"<<s;

    cout<<"Enter [Y] for continue:";

    string check;
    cin>>check;

    return (check=="Y" || check=="y");    
    }

    void Act1(){
        cout<<"Hey "<< "\033[1;32m" <<this->name<< "\033[31m"  <<" thanks for playing but i got nothing for you little gay man !";
    }

};



int main(){
    Game gameObject;

    while (true){
        if(gameObject.name==""){
            if ( gameObject.StartGame()){
                gameObject.takeName();
                gameObject.Act1();
                break;
            }
            else{
                break;
            }

        }

    }
    return 0;
}